{
  "conversaciones": [
    {
      "id": 1,
      "titulo": "Hoteles en Madrid",
      "mensajes": [
        {
          "rol": "user",
          "texto": "Hoteles en madrid",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Hola! Me encanta ayudarte a encontrar el hotel perfecto en Madrid. Para darte las mejores opciones, necesito conocer algunos detalles de tu viaje. ¿Cuándo planeas viajar a Madrid?",
          "tieneBoard": false
        },
        {
          "rol": "user",
          "texto": "El próximo mes, del 15 al 18 de marzo",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Perfecto, del 15 al 18 de marzo. ¿Cuántas personas serán? Y también me gustaría saber qué tipo de experiencia buscas en Madrid - ¿prefieres estar cerca del centro histórico, cerca de museos, o tienes alguna zona específica en mente?",
          "tieneBoard": false
        },
        {
          "rol": "user",
          "texto": "Somos 2 personas, mi pareja y yo. Queremos estar cerca del centro para poder caminar a los lugares principales",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Excelente elección, el centro de Madrid es perfecto para explorar caminando. Déjame buscar hoteles en esa zona para esas fechas. ¿Tienes alguna preferencia de precio o categoría de hotel?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Algo cómodo pero no muy caro, tal vez 3 o 4 estrellas",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Perfecto, he encontrado varias opciones excelentes de 3-4 estrellas en el centro de Madrid para esas fechas. Los precios están muy bien, entre 80-120€ por noche. ¿Te gustaría que filtre por alguna amenidad específica como desayuno incluido, gimnasio, o piscina?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Sí, que tenga desayuno incluido sería ideal",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Excelente! He filtrado los resultados y ahora tienes opciones fantásticas con desayuno incluido. Los precios siguen siendo muy competitivos. ¿Te gustaría ver fotos de alguno de estos hoteles o prefieres que te cuente más detalles sobre las ubicaciones específicas?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Me gustaría ver fotos del Hotel NH Collection Madrid Centro",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Perfecto! El NH Collection Madrid Centro es una excelente elección. Déjame mostrarte las fotos de este hotel. Tiene una ubicación privilegiada en el centro histórico y las habitaciones son muy elegantes. ¿Te gusta lo que ves?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Sí, me gusta mucho. ¿Qué habitaciones tienen disponibles?",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Excelente elección. Para esas fechas tienen varias opciones de habitaciones disponibles. Tienen habitaciones dobles estándar, habitaciones superiores con vista a la ciudad, y suites ejecutivas. Los precios van desde 95€ hasta 180€ por noche. ¿Qué tipo de habitación prefieres?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Una habitación superior con vista a la ciudad me parece perfecta",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Fantástico! La habitación superior con vista a la ciudad es de 125€ por noche, incluye desayuno buffet y tiene una vista espectacular del centro histórico de Madrid. Para 3 noches serían 375€ en total. ¿Te parece bien proceder con la reserva?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Sí, perfecto. Quiero hacer la reserva",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Excelente! Hace click en el botón de abajo para iniciar el proceso de reserva",
          "tieneBoard": true
        }
      ]
    },
    {
      "id": 2,
      "titulo": "Hotel Palladium Mexico - Sin disponibilidad",
      "mensajes": [
        {
          "rol": "user",
          "texto": "Hotel Palladium Mexico",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Hola! El Hotel Palladium es una excelente opción en México. Para ayudarte mejor, necesito saber cuándo planeas viajar y por cuántas noches. ¿Tienes fechas específicas en mente?",
          "tieneBoard": false
        },
        {
          "rol": "user",
          "texto": "Para el 20 de abril, por 5 noches",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Perfecto, del 20 al 25 de abril. Déjame verificar la disponibilidad en el Hotel Palladium para esas fechas. ¿Cuántas personas serán y qué tipo de habitación prefieres?",
          "tieneBoard": false
        },
        {
          "rol": "user",
          "texto": "Somos 2 adultos, una habitación doble está bien",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Entiendo perfectamente. Lamentablemente, el Hotel Palladium no tiene disponibilidad para esas fechas específicas. Pero no te preocupes, tengo excelentes alternativas en la misma zona con características similares. ¿Te gustaría que te muestre opciones comparables con precios similares?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "¿Qué otras opciones tienes en esa zona?",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "He encontrado varios hoteles de 4-5 estrellas en la misma zona con amenities similares al Palladium. Algunos incluso tienen mejores vistas y servicios. Los precios están muy competitivos para esas fechas. ¿Te interesa algún tipo específico de amenidad como spa, múltiples restaurantes, o acceso directo a la playa?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Me gustaría que tenga spa y acceso a la playa",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Perfecto! He filtrado las opciones y ahora tienes hoteles fantásticos con spa y acceso directo a la playa. Algunos incluso tienen mejores instalaciones que el Palladium original. ¿Te gustaría ver fotos de estos hoteles o prefieres que te ayude a seleccionar una habitación específica?",
          "tieneBoard": true
        }
      ]
    },
    {
      "id": 3,
      "titulo": "Playa el próximo finde con sol",
      "mensajes": [
        {
          "rol": "user",
          "texto": "Quiero ir a la playa el próximo finde que hay sol",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Qué ganas de playa! Me encanta ayudarte a planificar un fin de semana perfecto. Para encontrar el destino ideal con buen clima, necesito saber desde dónde viajas y si tienes alguna preferencia de destino. ¿Desde qué ciudad sales y tienes algún país o región en mente?",
          "tieneBoard": false
        },
        {
          "rol": "user",
          "texto": "Salgo desde Madrid y me da igual el destino, solo quiero sol y playa",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Perfecto, desde Madrid tienes opciones increíbles. Déjame revisar las tendencias de clima para el próximo fin de semana y buscar destinos con las mejores condiciones. ¿Prefieres un vuelo corto (2-3 horas) o no te importa viajar un poco más lejos?",
          "tieneBoard": false
        },
        {
          "rol": "user",
          "texto": "Prefiero vuelos cortos, máximo 3 horas",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Excelente elección. He revisado las tendencias climáticas y tengo opciones fantásticas con vuelos cortos desde Madrid. Los precios están muy bien para el próximo fin de semana. ¿Tienes alguna preferencia de tipo de playa - más urbana con actividades, o más tranquila y relajante?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Algo tranquilo, para relajarme",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Perfecto, he filtrado destinos con playas tranquilas y relajantes. Los precios están excelentes para el próximo fin de semana. ¿Te gustaría que busque hoteles en estos destinos o prefieres primero decidir el destino específico?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Busca hoteles, algo cómodo cerca de la playa",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Fantástico! He encontrado hoteles perfectos cerca de la playa en estos destinos tranquilos. Todos tienen excelentes ubicaciones y precios muy competitivos para el próximo fin de semana. ¿Te gustaría ver fotos de estos hoteles o prefieres que te ayude a seleccionar una habitación específica?",
          "tieneBoard": true
        }
      ]
    },
    {
      "id": 4,
      "titulo": "Vuelo a Barcelona + Hotel con checkout",
      "mensajes": [
        {
          "rol": "user",
          "texto": "Busco un vuelo a Barcelona para el próximo mes",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Qué bueno que me consultes! Barcelona es una ciudad increíble, vas a amar tu viaje. Para encontrar el vuelo perfecto y asegurarte de conseguir las mejores tarifas, necesito algunos datos. ¿Tenías fechas ya definidas? Y desde qué ciudad estarías saliendo?",
          "tieneBoard": false
        },
        {
          "rol": "user",
          "texto": "Desde Madrid, el 10 al 15 de mayo",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Perfecto, del 10 al 15 de mayo desde Madrid. Te cuento que mayo es una época excelente para visitar Barcelona, el clima es ideal. ¿Cuántas personas viajarían? Y otra cosa importante, ¿preferís salir por la mañana para aprovechar mejor el día o te da igual el horario?",
          "tieneBoard": false
        },
        {
          "rol": "user",
          "texto": "Somos 2 personas, preferimos salir por la mañana",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Excelente, para 2 personas y salida matutina. Déjame buscar las mejores opciones para vos. Una consulta rápida: ¿preferís vuelo directo o te serviría una escala si el precio es mucho mejor? A veces la diferencia es significativa.",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Directo preferiblemente",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Perfecto, entiendo, los vuelos directos son más cómodos y ahorran tiempo. Mirá, encontré varias opciones muy buenas con salida por la mañana. Tengo 3 opciones que te recomiendo: Iberia a las 8:30 AM por $125.000 por persona, Vueling a las 7:45 AM por $110.000 por persona, y Air Europa a las 9:15 AM por $135.000 por persona. Todas son excelentes, pero el de Iberia a las 8:30 tiene el mejor balance entre horario y precio. ¿Cuál te interesa más o querés ver los detalles de todas?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Muéstrame detalles del vuelo de Iberia a las 8:30",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Excelente elección! El vuelo de Iberia a las 8:30 AM es perfecto. Salida el 10 de mayo desde Madrid-Barajas, llegás a Barcelona-El Prat a las 9:45 AM - así tenés el día completo por delante. Incluye equipaje de mano y servicio a bordo. El precio es de $125.000 por persona, total $250.000 para ambos. Te aviso que esta tarifa tiene buena disponibilidad pero suele llenarse rápido. ¿Te parece que lo reservemos ahora?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Sí, me gusta. Quiero agregarlo al carrito",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Perfecto! Para agregar productos al carrito necesitás estar registrado. Es súper rápido - solo necesitás email y contraseña. Una vez que ingreses, podés agregarlo al carrito y decidir: podés comprar solo el vuelo ahora mismo por $250.000, o si lo combinás con hotel tenemos descuentos especiales (hasta 5% de descuento en el hotel) y además Barcelona en mayo se llena bastante así que te recomiendo reservar hotel cuanto antes. ¿Tenés cuenta o querés crear una nueva?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "(ingresa con user y pass)",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Perfecto! Una vez que ingreses, el vuelo quedará guardado en tu carrito. Ya que estás organizando el viaje, te recomiendo que busquemos hotel también. Si reservás vuelo + hotel juntos además del descuento que mencioné, tenés otras ventajas como cancelación gratuita en ambos hasta 48 horas antes. ¿Te parece que busquemos algo cerca del centro?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Sí, busca hoteles para esas fechas",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Perfecto, déjame buscar lo mejor para vos. Barcelona tiene zonas súper diferentes y todas tienen su encanto. Te doy 3 opciones principales: centro histórico (Las Ramblas, Barrio Gótico - todo caminando, muy turístico), cerca de la playa (Barceloneta - más relajado, ambiente playero), o zona modernista (Paseo de Gracia - elegante, cerca de La Pedrera y Sagrada Familia). Para primera vez, el centro o zona modernista son las más recomendadas. ¿Cuál te llama más la atención o querés que busque en varias zonas?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Cerca del centro, para poder caminar a las principales atracciones",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Excelente elección, el centro es lo mejor para primera vez en Barcelona. Todo queda caminando y la experiencia es única. Te encontré opciones increíbles cerca de Las Ramblas y el Barrio Gótico - zonas súper seguras y con todo cerca. ¿Qué tipo de comodidad buscás? Tengo de 3, 4 y 5 estrellas. Para un viaje especial como el tuyo, te recomendaría 4 estrellas - el balance perfecto entre lujo y precio razonable.",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Algo cómodo, 4 estrellas está bien",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "Perfecto, 4 estrellas es ideal. Encontré opciones desde $120.000 hasta $195.000 por noche. Te voy a mostrar los 3 mejores que tengo ahora mismo: el Hotel Casa Fuster por $155.000 la noche (diseño modernista, spa, terraza con piscina), el Hotel 1898 por $135.000 la noche (ubicación excelente en Las Ramblas, estilo boutique), y el Hotel Praktik Rambla por $125.000 la noche (muy bien ubicado, precio excelente). Todos están súper bien ubicados. ¿Cuál te interesa más? ¿Querés que te muestre detalles de alguno en particular?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Muéstrame detalles del Hotel Casa Fuster",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "El Casa Fuster es una joya de Barcelona. Está en pleno Paseo de Gracia, a 2 cuadras de Las Ramblas y cerca de La Pedrera y la Sagrada Familia. Tiene arquitectura modernista increíble, spa completo, terraza con piscina con vistas espectaculares, y el restaurante es de primera. Las habitaciones son espaciosas, muy elegantes. Es de los hoteles más recomendados por los viajeros. ¿Querés ver las fotos para que te des una mejor idea?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Sí, muéstrame fotos",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Acá tenés las fotos! Como podés ver, es realmente hermoso. La terraza con piscina tiene vistas 360° de Barcelona - es espectacular para relajarse después de un día de caminar. Las habitaciones son súper amplias y con diseño único. Lo que más me gusta es la ubicación - estás a pasos de todo pero en una zona tranquila y elegante. ¿Qué te parece? ¿Te gusta lo que ves?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Sí, me encanta. Quiero agregarlo al carrito",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Me alegra que te haya gustado! Es una excelente elección. Antes de agregarlo al carrito, necesito que elijas el tipo de habitación. Tenemos 3 opciones: habitación estándar por $145.000 la noche, habitación superior con vista por $155.000 la noche (esta es la más elegida - tiene balcón con vistas increíbles), y suite junior por $195.000 la noche. La habitación superior con vista es la que más recomiendo porque realmente vale la pena la diferencia y además al combinarla con tu vuelo ya reservado tenés beneficios extras. ¿Cuál te gustaría?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "La habitación superior con vista me parece perfecta",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Excelente decisión! Esa habitación es la favorita de todos. Tiene balcón privado con vistas espectaculares de Barcelona, es más amplia, y el desayuno buffet está incluido. El precio normal es de $155.000 por noche, para las 5 noches serían $775.000 en total. Como ya tenés el vuelo en tu carrito, al agregar el hotel tenés un descuento automático del 5% en el hotel - eso te ahorra casi $39.000. Además, al completar vuelo + hotel, el descuento se aplica automáticamente y podés pagar todo junto con las mismas ventajas de cancelación. ¿Te parece bien agregarlo al carrito?",
          "tieneBoard": true
        },
        {
          "rol": "user",
          "texto": "Sí, agrégame el hotel al carrito",
          "tieneBoard": false
        },
        {
          "rol": "asistente",
          "texto": "¡Perfecto! Ya está todo en tu carrito. Tenés vuelo + hotel seleccionados - excelente que hayas elegido el paquete completo porque ya se aplicó automáticamente el descuento del 5% en el hotel. Tu reserva total es de $986.000 (vuelo: $250.000 + hotel: $736.000 con el descuento del 5% aplicado - te ahorraste $39.000). Todo está listo para confirmar. Al reservar vuelo + hotel juntos tenés hasta 48 horas para cancelar ambos sin cargo y además podés pagar en cuotas sin interés. ¿Querés revisar los detalles y proceder con el checkout?",
          "tieneBoard": true
        }
      ]
    }
  ]
}
